loadtest.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  variables:
    numbers:
      - [5, 99]
scenarios:
  - name: 'Return PI with decimal numbers from calculated param number'
    flow:
      - loop:
          - get:
              url: '/calculations/{{ $loopElement }}'
        over: numbers